In [109]:
import pandas as pd
import numpy as np

Performing column operation.

In [110]:
df = pd.DataFrame([['JOHN SMITH', 'john.smith@gmail.com'],['Jane Doe', 'jdoe@yahoo.com'],['joe schmo', 'joeschmo@hotmail.com']],
columns=['Name', 'Email'])
df

         Name                 Email
0  JOHN SMITH  john.smith@gmail.com
1    Jane Doe        jdoe@yahoo.com
2   joe schmo  joeschmo@hotmail.com

Using str() function to add another column.

In [111]:
#using lower function to lowercase the entire column = name_df.name_column.str.lower()
# what str does? converts specified value into a string
df["Lowercase Name"] = df.Name.str.lower()
df

         Name                 Email Lowercase Name
0  JOHN SMITH  john.smith@gmail.com     john smith
1    Jane Doe        jdoe@yahoo.com       jane doe
2   joe schmo  joeschmo@hotmail.com      joe schmo

Apply function = apply a "function" along an axis of the data frame, returns series or dataframe. Objects passed to the function are series objects

In [112]:
#apply function create the dataframe
df1 = pd.DataFrame([[4, 3, 5]] * 3, columns = ["A", "B", "C"])
df1

   A  B  C
0  4  3  5
1  4  3  5
2  4  3  5

In [113]:
#modify values for entire column and add new column
#modify values for entire dataframe 
df1["Sqr"] = df1.A.apply(np.sqrt)
df1

   A  B  C  Sqr
0  4  3  5  2.0
1  4  3  5  2.0
2  4  3  5  2.0

In [114]:
#apply function for all values returns data frame
df1.apply(np.sqrt)

     A         B         C       Sqr
0  2.0  1.732051  2.236068  1.414214
1  2.0  1.732051  2.236068  1.414214
2  2.0  1.732051  2.236068  1.414214

In [115]:
#apply using axis along rows, axis = 0  return series sum of column values with index column name axis = 1 return series sum of row values with index of dataframe indexes
df2 = df1.apply(np.sum, axis = 1)
#print(type(df2))
df2

0    14.0
1    14.0
2    14.0
dtype: float64

Lambda function is a way of defening a function in a single line of code ussualy assign it to a variable.
Lambda works with all types of variable like strings not only integers 
lambda x: [outcome if true] if [conditional] else [outcome if false]
Applyng lambda to a column, for example we want to create a column with email provider of each email address
split() separates a string into a list of strings, you can specify separator where to split the string, maxsplit specifies how many splits to do in our case which halve to keep in to the column 
we can also operate on multiple columns by not specifying the column name and including axis = 1 the output would be an entire row not a column df["new_column_name"] = df.apply(lambda row: row["column_name"] * quantity if row.second_column == "Yes" else row["column_name"]) we can access in both way row.colomn_name or row["colomn_name"]

In [116]:
my_lambda = lambda x: (x + 3) ** 2
my_lambda(2)

25

In [117]:
lambda_str = lambda x: x.lower()
lambda_str("HELLO")
mylambda = lambda x: x[0] + x[len(x)-1]
mylambda("Hello world")

'Hd'

In [118]:
mylambda = lambda x: "Batterfield No!" if x >= 13 else "Wellcome!!!"
print(mylambda(12))

Wellcome!!!

In [119]:
#applying lambda to a column
df["email_provider"] = df.Email.apply(lambda x: x.split('@')[-1])
df

         Name                 Email Lowercase Name email_provider
0  JOHN SMITH  john.smith@gmail.com     john smith      gmail.com
1    Jane Doe        jdoe@yahoo.com       jane doe      yahoo.com
2   joe schmo  joeschmo@hotmail.com      joe schmo    hotmail.com

In [120]:
#apply lambda to a row
df3 = pd.DataFrame({"names":['Lauren Durham','Grace Sellers','Shirley Rasmussen','Brian Rojas','Samantha Mosley','Louis Guzman','Denise Mcclure','James Raymond'], "hourly_wage" : [19, 18, 14, 17, 19, 18, 13, 17], "hours_worked" : [43,30,47,38,39,40,42,45]})
df3

               names  hourly_wage  hours_worked
0      Lauren Durham           19            43
1      Grace Sellers           18            30
2  Shirley Rasmussen           14            47
3        Brian Rojas           17            38
4    Samantha Mosley           19            39
5       Louis Guzman           18            40
6     Denise Mcclure           13            42
7      James Raymond           17            45

In [130]:
total_earned = lambda row: row["hourly_wage"] * (40 + (row["hours_worked"] - 40) * 1.5) if row["hours_worked"]  > 40 else row["hours_worked"] * row["hourly_wage"]
df3["total_earned"] = df3.apply(total_earned, axis = 1)
df3

               names  hourly_wage  hours_worked  total_earned
0      Lauren Durham           19            43         845.5
1      Grace Sellers           18            30         540.0
2  Shirley Rasmussen           14            47         707.0
3        Brian Rojas           17            38         646.0
4    Samantha Mosley           19            39         741.0
5       Louis Guzman           18            40         720.0
6     Denise Mcclure           13            42         559.0
7      James Raymond           17            45         807.5

In [132]:
#renaming columns but for all at once, this command modify existing dataframe
df3.columns = ["Names", "Hourlywage", "Hours_worked", "Total_earned"]
df3

               Names  Hourlywage  Hours_worked  Total_earned
0      Lauren Durham          19            43         845.5
1      Grace Sellers          18            30         540.0
2  Shirley Rasmussen          14            47         707.0
3        Brian Rojas          17            38         646.0
4    Samantha Mosley          19            39         741.0
5       Louis Guzman          18            40         720.0
6     Denise Mcclure          13            42         559.0
7      James Raymond          17            45         807.5

In [135]:
#recapitulare
df4 = df3[df3.Names == "Grace Sellers"]
df4

           Names  Hourlywage  Hours_worked  Total_earned
1  Grace Sellers          18            30         540.0

In [149]:
df5 = df3[(df3.Hourlywage >= 18) & (df3["Hours_worked"] == 30)]
df5

           Names  Hourlywage  Hours_worked  Total_earned
1  Grace Sellers          18            30         540.0

In [159]:
#second way to modify the header with method rename(),aceasta metod creeaza un nou data frame  keyword inplace save unchanged the original data frame
df6 = pd.DataFrame({'name': ['John', 'Jane', 'Sue', 'Fred'],'age': [23, 29, 21, 18]})

df6.rename(columns = {"name" : "Name", "age" : "Age"}, inplace = True)
print(df6)

   Name  Age
0  John   23
1  Jane   29
2   Sue   21
3  Fred   18

In [162]:
df6.reset_index()
df6

   Name  Age
0  John   23
1  Jane   29
2   Sue   21
3  Fred   18

In [164]:
#metoda de calcul intre  doua coloane
df3["starter"] = df3["Hourlywage"] - df3["Hours_worked"]
df3

               Names  Hourlywage  Hours_worked  Total_earned  starter
0      Lauren Durham          19            43         845.5      -24
1      Grace Sellers          18            30         540.0      -12
2  Shirley Rasmussen          14            47         707.0      -33
3        Brian Rojas          17            38         646.0      -21
4    Samantha Mosley          19            39         741.0      -20
5       Louis Guzman          18            40         720.0      -22
6     Denise Mcclure          13            42         559.0      -29
7      James Raymond          17            45         807.5      -28